### 1. Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years old

In [12]:
from datetime import date
import pandas as pd
import numpy as np

In [10]:
name,age = input('Enter Your Name and age separed by SPACE').split()
todays_date = date.today()
year = todays_date.year + (100-int(age))
print(f'{name} You will reach in the {year} to reach 100 years old')

Enter Your Name and age separed by SPACEraj 33
raj You will reach in the 2089 to reach 100 years old

### 2.What is pandas groupby? Demonstrate with your own example

In [13]:
pdlist2 = pd.DataFrame([[25,'Black','SW',1],
                        [30,'Black','NW',1],
                        [45,'Red','NE',1],
                        [35,'Blond','SW',0],
                        [33,'Brown','SW',0],
                        [35,'Brown','NE',0],
                        [25,'Black','SW',0],
                        [52,'Brown','SE',0],
                        [21,'Blond','SW',1],
                        [24,'Blond','NE',0],
                        [48,'Black','SW',1],
                        [22,'Black','SW',0],
                        [27,'Brown','NE',0],
                        [28,'Black','SE',1],
                        [21,'Blond','SE',1],
                        [51,'Black','NW',0],
                        [23,'Brown','SE',1],                        
                       ]
                       ,columns =['AGE','HAIR COLOR','US REGION','VALIDATION'] )

In [16]:
pdlist2.groupby(['US REGION'])['AGE'].count()

US REGION
NE    4
NW    2
SE    4
SW    7
Name: AGE, dtype: int64

### 3. How to create a dataframe from list?

In [18]:
list2 = [[1,20221,'raj','33','s.devloper',12345,'rajgg.xx.com','M'],
         [2,20222,'tom','34','s.devloper',12346,'tomgg.xx.com','M'],
         [3,20223,'jack','30','devloper',123456,'jackgg.xx.com','M'],
         [4,20224,'Jessy','28','s.devloper',1234,'jesmgg.xx.com','F']]
pdlist1 = pd.DataFrame(list2,columns =['SLNO','EMP ID','NAME','AGE','DESIG','CON NUMBER','MAIL ID','GENDER'] )
pdlist1

   SLNO  EMP ID   NAME AGE       DESIG  CON NUMBER        MAIL ID GENDER
0     1   20221    raj  33  s.devloper       12345   rajgg.xx.com      M
1     2   20222    tom  34  s.devloper       12346   tomgg.xx.com      M
2     3   20223   jack  30    devloper      123456  jackgg.xx.com      M
3     4   20224  Jessy  28  s.devloper        1234  jesmgg.xx.com      F

### 4. What are the ways to combine the dataframe in pandas. Give an example for each

In [ ]:
# M1 : Merge : on,left_on,right_on, how
#m2 : Concat : rowwise and column wise (axis=1)

In [46]:
pdlist2 = pd.DataFrame([[25,'Black','SW',1],
                        [30,'Black','NW',1],
                        [45,'Red','NE',1],
                        [35,'Blond','SW',0],
                        [33,'Brown','SW',0],
                        [35,'Brown','NE',0],
                        [25,'Black','SW',0],
                        [52,'Brown','SE',0],
                        [21,'Blond','SW',1],
                        [24,'Blond','NE',0],
                        [48,'Black','SW',1],
                        [22,'Black','SW',0],
                        [27,'Brown','NE',0],
                        [28,'Black','SE',1],
                        [21,'Blond','SE',1],
                        [51,'Black','NW',0],
                        [23,'Brown','SE',1],                        
                       ]
                       ,columns =['AGE','HAIR COLOR','US REGION','VALIDATION'] )

In [53]:
pdlist3 = pdlist2.iloc[:10]
pdlist4 = pdlist2.iloc[10:]

In [50]:
pdlist3

   AGE HAIR COLOR US REGION  VALIDATION
0   25      Black        SW           1
1   30      Black        NW           1
2   45        Red        NE           1
3   35      Blond        SW           0
4   33      Brown        SW           0
5   35      Brown        NE           0
6   25      Black        SW           0
7   52      Brown        SE           0
8   21      Blond        SW           1
9   24      Blond        NE           0

In [54]:
pdlist4

    AGE HAIR COLOR US REGION  VALIDATION
10   48      Black        SW           1
11   22      Black        SW           0
12   27      Brown        NE           0
13   28      Black        SE           1
14   21      Blond        SE           1
15   51      Black        NW           0
16   23      Brown        SE           1

In [56]:
pd.merge(pdlist3, pdlist4, on='US REGION')

,AGE_x,HAIR COLOR_x,US REGION,VALIDATION_x,AGE_y,HAIR COLOR_y,VALIDATION_y
0,25,Black,SW,1,48,Black,1
1,25,Black,SW,1,22,Black,0
2,35,Blond,SW,0,48,Black,1
3,35,Blond,SW,0,22,Black,0
4,33,Brown,SW,0,48,Black,1
5,33,Brown,SW,0,22,Black,0
6,25,Black,SW,0,48,Black,1
7,25,Black,SW,0,22,Black,0
8,21,Blond,SW,1,48,Black,1
9,21,Blond,SW,1,22,Black,0
10,30,Black,NW,1,51,Black,0
11,45,Red,NE,1,27,Brown,0
12,35,Brown,NE,0,27,Brown,0
13,24,Blond,NE,0,27,Brown,0
14,52,Brown,SE,0,28,Black,1
15,52,Brown,SE,0,21,Blond,1
16,52,Brown,SE,0,23,Brown,1

In [57]:
pd.concat([pdlist3, pdlist4])

    AGE HAIR COLOR US REGION  VALIDATION
0    25      Black        SW           1
1    30      Black        NW           1
2    45        Red        NE           1
3    35      Blond        SW           0
4    33      Brown        SW           0
5    35      Brown        NE           0
6    25      Black        SW           0
7    52      Brown        SE           0
8    21      Blond        SW           1
9    24      Blond        NE           0
10   48      Black        SW           1
11   22      Black        SW           0
12   27      Brown        NE           0
13   28      Black        SE           1
14   21      Blond        SE           1
15   51      Black        NW           0
16   23      Brown        SE           1

In [59]:
pd.concat([pdlist3, pdlist4],axis=1)

,AGE,HAIR COLOR,US REGION,VALIDATION,AGE,HAIR COLOR,US REGION,VALIDATION
0,25.0,Black,SW,1.0,NaN,NaN,NaN,NaN
1,30.0,Black,NW,1.0,NaN,NaN,NaN,NaN
2,45.0,Red,NE,1.0,NaN,NaN,NaN,NaN
3,35.0,Blond,SW,0.0,NaN,NaN,NaN,NaN
4,33.0,Brown,SW,0.0,NaN,NaN,NaN,NaN
5,35.0,Brown,NE,0.0,NaN,NaN,NaN,NaN
6,25.0,Black,SW,0.0,NaN,NaN,NaN,NaN
7,52.0,Brown,SE,0.0,NaN,NaN,NaN,NaN
8,21.0,Blond,SW,1.0,NaN,NaN,NaN,NaN
9,24.0,Blond,NE,0.0,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,48.0,Black,SW,1.0
11,NaN,NaN,NaN,NaN,22.0,Black,SW,0.0
12,NaN,NaN,NaN,NaN,27.0,Brown,NE,0.0
13,NaN,NaN,NaN,NaN,28.0,Black,SE,1.0
14,NaN,NaN,NaN,NaN,21.0,Blond,SE,1.0
15,NaN,NaN,NaN,NaN,51.0,Black,NW,0.0
16,NaN,NaN,NaN,NaN,23.0,Brown,SE,1.0

### 5.What is the difference between list and tuples in Python?

In [33]:
#List are mutable , tuple are immutable.

In [34]:
list1 = [1,2,3,4]
list1[1] = 10

In [35]:
list1

[1, 10, 3, 4]

In [36]:
tup1 = (1,2,3,4)
tup1[1] = 10

TypeError: 'tuple' object does not support item assignment

### 6. Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [19]:
list1 = [1,5,3,100,4,48]

In [20]:
nparr = np.array(list1)

In [65]:
npmean = nparr.mean()
npmedian = np.median(nparr)
npstddev = np.std(nparr)

In [27]:
npmean

26.833333333333332

In [62]:
npmedian

4.5

In [64]:
npstddev

36.59424666377065

### 7.How will you remove duplicate elements from a list

In [ ]:
# M1 :When we convert into set all duplicates will be removed.
# M2 : Need to make empty list and loop the list and append the value if the value not exits in the new list.

In [37]:
list1 = [1,2,3,4,4]

In [38]:
set1 = set(list1)

In [39]:
set1

{1, 2, 3, 4}

### 8.What is a map() function in Python? Give an example

In [45]:
# map is used to map the all the values with our expression
org_list = [12, 11, 53, 22, 21, 77, 87, 88, 98]
list1 = list(filter(lambda x : x % 2 != 0, org_list))
list2= list(map(lambda x: x**2,list1))
print(list2)

[121, 2809, 441, 5929, 7569]

### 9. What is pass in Python?

In [40]:
# Pass is used to execute our code with the initiation
def fnname():
    pass

In [41]:
def fnname():

IndentationError: expected an indented block (Temp/ipykernel_14512/3974333321.py, line 1)

### 10.What is vstack() in numpy? Give an example

In [42]:
arr1 = np.array([10,20,30,40,50,60,70])
arr2 = np.array([5,5,5,5,5,5,5])

In [43]:
#Stack arrays in sequence vertically (row wise).
np.vstack((arr1,arr2))

array([[10, 20, 30, 40, 50, 60, 70],
       [ 5,  5,  5,  5,  5,  5,  5]])